#include <stdio.h>

//функция вычисляет следующий шаг после step.

int next_step(int step, int k) {
    
    step = step + k; //следующий шаг на k больше
    if (step < 0) { //назад не идем!
        step = 0; //топчемся на месте
    }
    
    return step;
}

int main() {
    int L; //первый шаг робота
    int k; //следующий шаг на k меньше
    int s; //расстояние до стены
    int dist; //сколько сантиметров не дошел робот

    int i; //закончилось шагов
    int step; //длина 1 шага
    int path; //прошли всего снала

    scanf("%d%d%d", &s, &L, &k);

    //робот готовится шагать:
    i = 0; //робот еще не сделал ни одного шага
    step = L; //первый шаг будет L
    path = 0; //робот еще не прошел ничего
    dist = s;

    while (step <= dist) { //Пока робот идет
        dist -= step;
        path += step; //прошел еще step см
        i++; //закончили шаг
        //printf("За %d шаг прошли %d, всего %d\n", i, step, path);
        step = next_step(step, k); //готовимся к следующему шагу, планируем сколько пройти
    }

    //робот закончил шаги, больше никуда не идем, печатаем ответ
    printf("За %d шагов робот прошел %d см\n", i, dist);

return 0;
}