#include <stdio.h>

int main() {
    int L; //прошли в первый день
    int k; //каждый день проходим на k больше

    int i; //закончилось дней
    int step; //проходим за 1 дней
    int path; //прошли всего с начала похода

    //читаем входные данные (что дано)
    scanf("%d", &L);
    scanf("%d", &k);

    //готовимся к походу:
    i = 0; //поход не начался
    step = L; //планируем в первый день пройти L
    path = 0; //еще не прошли ничего

    while (i != 100 && L != 100) {
        path += step; //прошли еще step км
        i++; //закончили день
        step += k; //готовимся к завтрашнему дню, планируем сколько пройти
    }

    //поход окончен, больше никуда не идем, печатаем ответ
    printf("%d\n", path);

    return 0;
}